Revit 2024 API
RebarConstraintsManager.IsRebarConstrainedPlacementEnabled Property
 A static property defining if the 'Rebar Constrained Placement' setting is on or off in current Revit Application Session.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static bool IsRebarConstrainedPlacementEnabled { get; set; }
Visual Basic
Public Shared Property IsRebarConstrainedPlacementEnabled As Boolean
	Get
	Set
Visual C++
public:
static property bool IsRebarConstrainedPlacementEnabled {
	bool get ();
	void set (bool value);
}
Remarks
 If user started multiple Revit sessions, and the 'Rebar Constrained Placement' setting might be different in each session. Revit.ini file stores the latest setting no matter what the Revit session is. The setting will be written to Revit.ini if user set the value. This property enables/disables constraints between standard style rebars. This constraint is similar to the standard-to-stirrup constraint in the following way : Distance to target cannot be edited. The constraint "snaps" the rebars together in a touching position. Rebars can be constrained under the following conditions :
Rebars have standard style. (not stirrups)
The segments must be touching. (partially overlapped)
If the segments are perfectly overlapped (i.e segments have the same center line) then the constraint will not take place.
Only one segment per rebar can be constrained.
If one of the segments touches (intersects) more than one segment (or arc), then the constraint will not happen.
The segments being constrained are parallel and the bending and segment planes are parallel.
See Also
RebarConstraintsManager Class
Autodesk.Revit.DB.Structure Namespace